[
  {
    "id": "chatgpt-prompting",
    "title": "ChatGPT Prompting Guide",
    "category": "AI Tools",
    "type": "external",
    "description": "Master the art of prompting to get better results from ChatGPT and other LLMs.",
    "url": "https://platform.openai.com/docs/guides/prompt-engineering",
    "icon": "sparkles"
  },
  {
    "id": "linkedin-learning-ai",
    "title": "LinkedIn Learning: AI Courses",
    "category": "Learning",
    "type": "external",
    "description": "Free AI courses available through NJIT's LinkedIn Learning subscription.",
    "url": "https://www.linkedin.com/learning/topics/artificial-intelligence",
    "icon": "graduation"
  },
  {
    "id": "github-student-pack",
    "title": "GitHub Student Developer Pack",
    "category": "Tools",
    "type": "external",
    "description": "Free developer tools, cloud credits, and learning resources for students.",
    "url": "https://education.github.com/pack",
    "icon": "code"
  },
  {
    "id": "figma-students",
    "title": "Figma for Education",
    "category": "Tools",
    "type": "external",
    "description": "Free Figma Pro for students - design portfolios, mockups, and prototypes.",
    "url": "https://www.figma.com/education/",
    "icon": "design"
  },
  {
    "id": "notion-templates",
    "title": "Notion for Students",
    "category": "Tools",
    "type": "external",
    "description": "Free Notion Plus for students - organize projects, notes, and job applications.",
    "url": "https://www.notion.so/students",
    "icon": "organize"
  },
  {
    "id": "linkedin-optimization",
    "title": "How to Optimize Your LinkedIn for AI Jobs",
    "category": "Professional Presence",
    "type": "internal",
    "description": "Transform your LinkedIn profile into an AI job magnet with these proven strategies.",
    "icon": "linkedin",
    "fullDescription": "LinkedIn is where 87% of recruiters search for AI talent. Your profile is often the first impression you make on potential employers. A well-optimized profile can lead to inbound job opportunities, networking connections, and visibility in the AI community.",
    "content": [
      {
        "heading": "Why LinkedIn Matters for AI Careers",
        "text": "LinkedIn is where 87% of recruiters search for AI talent. Your profile is often the first impression you make on potential employers. A well-optimized profile can lead to inbound job opportunities, networking connections, and visibility in the AI community. Many AI startups and tech companies exclusively recruit through LinkedIn, making it essential for your job search."
      },
      {
        "heading": "Craft a Compelling Headline",
        "text": "Your headline is prime real estate - don't waste it on just your job title. Instead of 'Computer Science Student at NJIT', try 'AI/ML Engineer in Training | Python & TensorFlow | Building Intelligent Systems | Open to Opportunities'. Include 2-3 key skills, your focus area, and a call-to-action. Use keywords recruiters search for: Machine Learning, AI, Data Science, NLP, Computer Vision, Deep Learning."
      },
      {
        "heading": "Write an Engaging About Section",
        "text": "Your About section should tell your story in 3-4 paragraphs. Start with a hook that captures attention. Describe your passion for AI and what drives you. Highlight 2-3 key projects or achievements with specific results (e.g., 'Built a sentiment analysis model with 94% accuracy'). End with what you're looking for and how to contact you. Write in first person - it's more personable and engaging."
      },
      {
        "heading": "Showcase Your AI Projects",
        "text": "The Featured and Projects sections are crucial for AI roles. For each project include: the problem you solved, technologies used (Python, TensorFlow, PyTorch, scikit-learn), your specific contributions, and measurable results. Link to GitHub repos, live demos, or detailed write-ups. Add media like screenshots, architecture diagrams, or video demos. Even course projects count - frame them professionally."
      },
      {
        "heading": "Skills & Endorsements Strategy",
        "text": "Add at least 15-20 relevant skills, prioritizing: Python, Machine Learning, Deep Learning, TensorFlow, PyTorch, SQL, Data Analysis, NLP, Computer Vision, and cloud platforms (AWS, GCP, Azure). Pin your top 3 most relevant skills. Ask classmates and colleagues for endorsements - offer to endorse them back. Take LinkedIn Skill Assessments to earn badges that boost credibility."
      },
      {
        "heading": "Build Your Network Strategically",
        "text": "Connect with: AI researchers and practitioners, recruiters at target companies, NJIT alumni in tech, people you meet at events, and thought leaders you follow. When connecting, always send a personalized note explaining why you want to connect. Aim for 500+ connections to expand your reach. Join AI-focused LinkedIn groups and participate in discussions."
      },
      {
        "heading": "Content Strategy for Visibility",
        "text": "Post regularly to stay visible in your network's feed. Share: your project updates and learnings, interesting AI papers or articles with your take, course completions and certifications, event attendance and key takeaways. Comment thoughtfully on posts by AI leaders. Aim for 2-3 posts per week. Use relevant hashtags: #MachineLearning #AI #DataScience #TechCareers."
      },
      {
        "heading": "Quick Wins Checklist",
        "text": "Complete these today: Upload a professional headshot (clear face, neutral background), add a custom banner image (Canva has free templates), turn on 'Open to Work' (visible to recruiters only), add your NJIT email to verify your education, request 3 recommendations from professors or supervisors, and follow 20 companies you'd like to work for."
      }
    ],
    "actionText": "Update Your LinkedIn",
    "actionUrl": "https://www.linkedin.com/in/"
  },
  {
    "id": "github-profile",
    "title": "Build a GitHub Profile That Gets You Interviews",
    "category": "Professional Presence",
    "type": "internal",
    "description": "Learn how to showcase your coding skills and projects on GitHub to impress recruiters.",
    "icon": "code",
    "fullDescription": "GitHub is your coding portfolio. Recruiters and hiring managers review GitHub profiles to assess your actual coding skills, not just what's on your resume. A strong GitHub presence demonstrates your coding ability, project experience, collaboration skills, and consistency.",
    "content": [
      {
        "heading": "Why GitHub Matters",
        "text": "GitHub is your coding portfolio. Recruiters and hiring managers review GitHub profiles to assess your actual coding skills, not just what's on your resume. A strong GitHub presence demonstrates: your coding ability, project experience, collaboration skills, consistency and commitment, and how you write documentation. Many companies now require GitHub links in applications."
      },
      {
        "heading": "Create an Impressive Profile README",
        "text": "A profile README (shown on your profile page) is your chance to make a great first impression. Create a repo named exactly your username (e.g., github.com/yourname/yourname). Include: a brief introduction and what you're passionate about, your tech stack with skill badges, current projects you're working on, how to reach you, and fun facts or interests. Use tools like GitHub Profile README Generator for templates."
      },
      {
        "heading": "Pin Your Best Repositories",
        "text": "You can pin up to 6 repositories to your profile - choose wisely. Select projects that: demonstrate different skills, have clean code and good documentation, show real-world problem-solving, are actively maintained or completed. Include a mix: one ML/AI project, one web project, one data analysis project, and contributions to open source if any."
      },
      {
        "heading": "Write Professional READMEs",
        "text": "Every pinned repo needs a stellar README with: project title and one-line description, problem statement (what does it solve?), tech stack and dependencies, installation instructions, usage examples with screenshots/GIFs, your approach and architecture decisions, results and metrics if applicable, future improvements planned, and how to contribute. Use README templates to ensure consistency."
      },
      {
        "heading": "Maintain a Green Contribution Graph",
        "text": "The contribution graph shows your coding consistency. Aim for regular activity, not just sporadic bursts. Ways to stay green: commit small improvements daily, work on personal projects consistently, contribute to open source (even documentation helps), solve coding challenges and commit solutions. Quality matters more than quantity, but consistency signals dedication."
      },
      {
        "heading": "Code Quality Best Practices",
        "text": "Recruiters will look at your actual code. Ensure: meaningful variable and function names, consistent formatting (use linters), comments explaining complex logic, modular and organized structure, no secrets or API keys committed (use .env files), proper .gitignore files. Write code as if someone else will maintain it - because recruiters are evaluating exactly that."
      },
      {
        "heading": "Showcase AI/ML Projects Effectively",
        "text": "For AI/ML repositories specifically: include Jupyter notebooks with clear explanations, show your data exploration process, document model architecture decisions, include training metrics and visualizations, provide a requirements.txt or environment.yml, add a demo or Streamlit/Gradio app if possible, explain your results in plain English."
      },
      {
        "heading": "Contribute to Open Source",
        "text": "Open source contributions are highly valued. Start with: 'good first issue' labeled issues, documentation improvements, bug fixes in tools you use, adding tests to existing projects. Great AI/ML repos for beginners: scikit-learn, Hugging Face, fast.ai, MLflow. Even small contributions show you can work in collaborative codebases."
      },
      {
        "heading": "GitHub Profile Checklist",
        "text": "Complete these steps: Add a professional profile photo, write a compelling bio (160 chars max), add your location and website/portfolio link, create your profile README, pin 6 best repositories, ensure all pinned repos have READMEs, set up GitHub Pages for your portfolio, enable 'Available for hire' in settings, add your LinkedIn and email to profile."
      }
    ],
    "actionText": "Edit Your GitHub Profile",
    "actionUrl": "https://github.com/settings/profile"
  },
  {
    "id": "portfolio-guide",
    "title": "Professional Portfolio Checklist",
    "category": "Portfolio",
    "type": "internal",
    "description": "Everything you need to build a portfolio that showcases your AI skills and lands interviews.",
    "icon": "briefcase",
    "fullDescription": "A personal portfolio website sets you apart from other candidates. It's a space you fully control to showcase your best work, personality, and professional brand. This guide includes a link to a model portfolio you can reference.",
    "content": [
      {
        "heading": "Why You Need a Portfolio",
        "text": "A personal portfolio website sets you apart from other candidates. It's a space you fully control to showcase your best work, personality, and professional brand. Unlike LinkedIn or GitHub, your portfolio tells YOUR story the way YOU want. It demonstrates web skills, attention to detail, and professionalism. Many AI roles require presenting work - your portfolio is practice."
      },
      {
        "heading": "Essential Portfolio Sections",
        "text": "Every strong portfolio needs: Hero section with your name, title, and value proposition; About section with your background and what drives you; Projects section with 3-5 detailed case studies; Skills section showing your tech stack; Experience/Education timeline; Contact section with multiple ways to reach you. Optional but impressive: blog, testimonials, downloadable resume."
      },
      {
        "heading": "Project Case Studies That Impress",
        "text": "Don't just list projects - tell the story. For each project include: the problem or challenge, your approach and why you chose it, technologies and tools used, obstacles you overcame, results with specific metrics, what you learned, and links to live demo/GitHub. Use visuals: screenshots, architecture diagrams, before/after comparisons, data visualizations."
      },
      {
        "heading": "Design Tips for Non-Designers",
        "text": "You don't need to be a designer to have a great portfolio. Use a clean, minimal template (less is more). Stick to 2-3 colors maximum. Use one font family (or two max). Ensure plenty of white space. Make text readable (16px+ body text). Use high-quality images. Ensure mobile responsiveness. Tools: use templates from HTML5 UP, Webflow, or build with React."
      },
      {
        "heading": "Technical Requirements",
        "text": "Your portfolio should: load fast (under 3 seconds), be mobile responsive, have HTTPS enabled, include meta tags for SEO, have working links (check regularly), be accessible (alt text, good contrast). Free hosting options: GitHub Pages, Netlify, Vercel. Custom domain (~$12/year) looks more professional."
      },
      {
        "heading": "Model Portfolio Reference",
        "text": "Study this example portfolio for inspiration: https://kaw393939.github.io/117_final_fall_2025/portfolio/ - Notice the clean layout, clear project descriptions, and professional presentation. Your portfolio doesn't need to be identical, but should have similar polish and completeness."
      },
      {
        "heading": "Portfolio Checklist",
        "text": "Use this checklist to ensure your portfolio is complete: Professional headshot or avatar, Clear headline stating who you are, Compelling about section, At least 3 detailed projects, Skills/technologies listed, Education and experience, Contact form or email link, Links to GitHub and LinkedIn, Mobile responsive design, Fast loading speed, Custom domain (optional but recommended), No typos or broken links."
      }
    ],
    "actionText": "View Example Portfolio",
    "actionUrl": "https://kaw393939.github.io/117_final_fall_2025/portfolio/"
  },
  {
    "id": "resume-tips",
    "title": "AI/ML Resume Best Practices",
    "category": "Career",
    "type": "internal",
    "description": "Craft a resume that passes ATS systems and impresses hiring managers in the AI industry.",
    "icon": "document",
    "fullDescription": "Your resume needs to pass automated screening systems AND impress human reviewers. This guide covers both with specific tips for AI/ML roles.",
    "content": [
      {
        "heading": "ATS-Friendly Formatting",
        "text": "Use standard section headings (Experience, Education, Skills). Avoid tables, columns, or graphics. Save as PDF. Use standard fonts. Keep it to 1 page for students/new grads."
      },
      {
        "heading": "Quantify Everything",
        "text": "Use numbers: 'Improved model accuracy from 78% to 94%', 'Processed 1M+ records', 'Reduced inference time by 3x'. Numbers catch the eye and prove impact."
      },
      {
        "heading": "Technical Skills Section",
        "text": "List languages (Python, SQL), frameworks (TensorFlow, PyTorch, scikit-learn), tools (Jupyter, Git, Docker), and platforms (AWS, GCP). Match keywords from job descriptions."
      },
      {
        "heading": "Project Descriptions",
        "text": "Format: Action verb + What you did + Technology used + Result. Example: 'Developed a customer churn prediction model using XGBoost, achieving 92% accuracy and identifying $50K in at-risk revenue.'"
      },
      {
        "heading": "Tailor for Each Application",
        "text": "Customize your resume for each role. Match their keywords. Reorder projects to highlight most relevant experience. It takes time but dramatically improves response rates."
      }
    ],
    "actionText": "Download Resume Template",
    "actionUrl": "https://www.overleaf.com/gallery/tagged/cv"
  },
  {
    "id": "interview-prep",
    "title": "AI Interview Preparation Guide",
    "category": "Career",
    "type": "internal",
    "description": "Prepare for technical interviews with common AI/ML questions and coding challenges.",
    "icon": "chat",
    "fullDescription": "AI interviews typically include coding challenges, ML concepts, and system design. This guide helps you prepare for all three components.",
    "content": [
      {
        "heading": "Coding Fundamentals",
        "text": "Practice LeetCode medium problems focusing on: arrays, strings, trees, dynamic programming. For ML roles, focus on NumPy and Pandas manipulation. Aim for 2-3 problems daily."
      },
      {
        "heading": "ML Concepts to Know",
        "text": "Be ready to explain: bias-variance tradeoff, overfitting/underfitting, gradient descent, cross-validation, common algorithms (linear regression, decision trees, neural networks), and when to use each."
      },
      {
        "heading": "System Design Basics",
        "text": "For senior roles, know how to design: recommendation systems, fraud detection pipelines, real-time ML serving. Understand trade-offs between batch and real-time processing."
      },
      {
        "heading": "Behavioral Questions",
        "text": "Prepare stories using STAR method for: 'Tell me about a challenging project', 'How do you handle disagreements', 'Describe a time you failed'. Tie answers back to AI/ML when possible."
      },
      {
        "heading": "Questions to Ask",
        "text": "Always have questions ready: 'What does success look like in this role?', 'What's your ML infrastructure like?', 'How does the team stay current with AI developments?'"
      }
    ],
    "actionText": "Practice on LeetCode",
    "actionUrl": "https://leetcode.com/problemset/all/"
  },
  {
    "id": "coursera-ml",
    "title": "Coursera: Machine Learning Specialization",
    "category": "Learning",
    "type": "external",
    "description": "Andrew Ng's famous ML course - the gold standard for learning machine learning fundamentals.",
    "url": "https://www.coursera.org/specializations/machine-learning-introduction",
    "icon": "graduation"
  },
  {
    "id": "kaggle",
    "title": "Kaggle Competitions & Datasets",
    "category": "Learning",
    "type": "external",
    "description": "Practice ML with real datasets and compete in challenges to build your portfolio.",
    "url": "https://www.kaggle.com/",
    "icon": "data"
  },
  {
    "id": "calendly-setup",
    "title": "How to Set Up Calendly for Networking",
    "category": "Professional Presence",
    "type": "internal",
    "description": "Streamline your networking with professional scheduling - make it easy for mentors and recruiters to book time with you.",
    "icon": "calendar",
    "fullDescription": "Calendly eliminates the back-and-forth of scheduling meetings. It's essential for informational interviews, mentor meetings, recruiter calls, and networking coffee chats. Having a Calendly link shows you're organized and professional.",
    "content": [
      {
        "heading": "Why Use Calendly",
        "text": "Calendly eliminates the back-and-forth of scheduling meetings. It's essential for: informational interviews, mentor meetings, recruiter calls, and networking coffee chats. Having a Calendly link shows you're organized and professional. The free tier is perfect for students."
      },
      {
        "heading": "Setting Up Your Account",
        "text": "Go to calendly.com and sign up with your email. Connect your Google or Outlook calendar to show real availability. Set your timezone correctly. Add a professional profile photo and write a brief bio. Your Calendly link will be: calendly.com/yourname"
      },
      {
        "heading": "Create Event Types",
        "text": "Create at least two event types: a 15-minute 'Quick Chat' for brief networking calls, and a 30-minute 'Coffee Chat' for deeper conversations. Set buffer times between meetings (15 min recommended). Limit how far in advance people can book (2 weeks is good). Set minimum notice (24 hours)."
      },
      {
        "heading": "Professional Touches",
        "text": "Customize your booking page with: a professional welcome message, clear description of what the meeting is for, your preferred video platform (Zoom, Google Meet), confirmation and reminder emails. Add questions to collect info before meetings, like 'What would you like to discuss?'"
      },
      {
        "heading": "Using Calendly Effectively",
        "text": "Add your Calendly link to: your email signature, LinkedIn profile, portfolio website, and anywhere you network. When reaching out for informational interviews, include your link to make scheduling easy. Always send a thank-you note after meetings booked through Calendly."
      }
    ],
    "actionText": "Create Calendly Account",
    "actionUrl": "https://calendly.com/signup"
  }
]
